#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket_website_configuration.static_website_config_s3_dev: Refreshing state... [id=dev.plancraftr.com]
aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_dev: Refreshing state... [id=www.dev.plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3_www_dev: Refreshing state... [id=www.dev.plancraftr.com]
aws_cloudfront_function.dev_routing_handler: Refreshing state... [id=dev_routing_handler]
aws_s3_bucket.dev_plancraftr_com: Refreshing state... [id=dev.plancraftr.com]
aws_s3_bucket.www_dev_plancraftr_com: Refreshing state... [id=www.dev.plancraftr.com]
aws_route53_record.dev_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_dev.api.plancraftr.com_A]
aws_security_group.dev_server_plancraftr_sg: Refreshing state... [id=sg-03d3312484bb4166f]
aws_cloudfront_distribution.dev_distribution: Refreshing state... [id=E1DNZ6XUA45CP3]
aws_cloudfront_distribution.www_dev_distribution: Refreshing state... [id=E2ZV8ZQ6BEJ6OI]
aws_instance.dev_server_plancraftr: Refreshing state... [id=i-0576898d8096cc74f]
aws_route53_record.www_dev_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_www.dev.plancraftr.com_A]
aws_route53_record.dev_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_dev.plancraftr.com_A]
aws_s3_bucket_public_access_block.allow_public_access_s3_www_dev: Refreshing state... [id=www.dev.plancraftr.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.dev_distribution will be destroyed
  # (because aws_cloudfront_distribution.dev_distribution is not in configuration)
  - resource "aws_cloudfront_distribution" "dev_distribution" {
      - aliases                        = [
          - "dev.plancraftr.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::084828604403:distribution/E1DNZ6XUA45CP3" -> null
      - caller_reference               = "terraform-20250117055226330700000002" -> null
      - domain_name                    = "d35setsg7i1nw9.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "EG1199S0D0H3P" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E1DNZ6XUA45CP3" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2025-01-17 05:52:26.485 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - staging                        = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dev_s3_origin" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - grpc_config {
              - enabled = false -> null
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "dev.plancraftr.com.s3-website-ap-southeast-1.amazonaws.com" -> null
          - origin_id           = "dev_s3_origin" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:084828604403:certificate/f5772987-cecc-431c-b5fd-1e2bd7e0c727" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_cloudfront_distribution.staging_distribution will be created
  + resource "aws_cloudfront_distribution" "staging_distribution" {
      + aliases                         = [
          + "staging.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "staging_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config {
              + enabled = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "staging_s3_origin"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/243b8f73-9d67-4956-9f89-df37c6ad54f9"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.www_dev_distribution will be destroyed
  # (because aws_cloudfront_distribution.www_dev_distribution is not in configuration)
  - resource "aws_cloudfront_distribution" "www_dev_distribution" {
      - aliases                        = [
          - "www.dev.plancraftr.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::084828604403:distribution/E2ZV8ZQ6BEJ6OI" -> null
      - caller_reference               = "terraform-20250117055226329600000001" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d1vke0k0ycay30.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "ERPI9F20NL5BW" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E2ZV8ZQ6BEJ6OI" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2025-01-17 05:52:26.538 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - staging                        = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "www_dev_s3_origin" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::084828604403:function/dev_routing_handler" -> null
            }

          - grpc_config {
              - enabled = false -> null
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "www.dev.plancraftr.com.s3.ap-southeast-1.amazonaws.com" -> null
          - origin_id           = "www_dev_s3_origin" -> null
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:084828604403:certificate/f5772987-cecc-431c-b5fd-1e2bd7e0c727" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_cloudfront_distribution.www_staging_distribution will be created
  + resource "aws_cloudfront_distribution" "www_staging_distribution" {
      + aliases                         = [
          + "www.staging.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "www_staging_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

          + grpc_config {
              + enabled = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "www_staging_s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/243b8f73-9d67-4956-9f89-df37c6ad54f9"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_function.dev_routing_handler will be destroyed
  # (because aws_cloudfront_function.dev_routing_handler is not in configuration)
  - resource "aws_cloudfront_function" "dev_routing_handler" {
      - arn                          = "arn:aws:cloudfront::084828604403:function/dev_routing_handler" -> null
      - code                         = <<-EOT
            function handler(event) {
              var request = event.request;
            
              if (!request.uri.includes(".")) {
                request.uri = "/";
                request.querystring = {};
              }
            
              return request;
            }
        EOT -> null
      - comment                      = "handle routing" -> null
      - etag                         = "ETVPDKIKX0DER" -> null
      - id                           = "dev_routing_handler" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "ETVPDKIKX0DER" -> null
      - name                         = "dev_routing_handler" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "DEPLOYED" -> null
    }

  # aws_cloudfront_function.staging_routing_handler will be created
  + resource "aws_cloudfront_function" "staging_routing_handler" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
            
              if (!request.uri.includes(".")) {
                request.uri = "/";
                request.querystring = {};
              }
            
              return request;
            }
        EOT
      + comment         = "handle routing"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "staging_routing_handler"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_instance.dev_server_plancraftr will be destroyed
  # (because aws_instance.dev_server_plancraftr is not in configuration)
  - resource "aws_instance" "dev_server_plancraftr" {
      - ami                                  = "ami-047126e50991d067b" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:084828604403:instance/i-0576898d8096cc74f" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0576898d8096cc74f" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "plancraftr-server-ssh-keypair" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-085b818bc14f93f7c" -> null
      - private_dns                          = "ip-172-31-22-19.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "172.31.22.19" -> null
      - public_dns                           = "ec2-13-229-69-60.ap-southeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "13.229.69.60" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "dev_server_plancraftr_sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0746fa3d64ff385ef" -> null
      - tags                                 = {
          - "Name" = "dev_server_plancraftr"
        } -> null
      - tags_all                             = {
          - "Name" = "dev_server_plancraftr"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-03d3312484bb4166f",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0281e5e534e78fab0" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_instance.staging_server_plancraftr will be created
  + resource "aws_instance" "staging_server_plancraftr" {
      + ami                                  = "ami-047126e50991d067b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "plancraftr-server-ssh-keypair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_server_plancraftr"
        }
      + tags_all                             = {
          + "Name" = "staging_server_plancraftr"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_route53_record.dev_api_plancraftr will be destroyed
  # (because aws_route53_record.dev_api_plancraftr is not in configuration)
  - resource "aws_route53_record" "dev_api_plancraftr" {
      - fqdn                             = "dev.api.plancraftr.com" -> null
      - id                               = "Z097947118UN4SFV6P8TX_dev.api.plancraftr.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "dev.api.plancraftr.com" -> null
      - records                          = [
          - "13.229.69.60",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z097947118UN4SFV6P8TX" -> null
    }

  # aws_route53_record.dev_plancraftr will be destroyed
  # (because aws_route53_record.dev_plancraftr is not in configuration)
  - resource "aws_route53_record" "dev_plancraftr" {
      - fqdn                             = "dev.plancraftr.com" -> null
      - id                               = "Z097947118UN4SFV6P8TX_dev.plancraftr.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "dev.plancraftr.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z097947118UN4SFV6P8TX" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d35setsg7i1nw9.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_record.staging_api_plancraftr will be created
  + resource "aws_route53_record" "staging_api_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.api.plancraftr.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"
    }

  # aws_route53_record.staging_plancraftr will be created
  + resource "aws_route53_record" "staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www_dev_plancraftr will be destroyed
  # (because aws_route53_record.www_dev_plancraftr is not in configuration)
  - resource "aws_route53_record" "www_dev_plancraftr" {
      - fqdn                             = "www.dev.plancraftr.com" -> null
      - id                               = "Z097947118UN4SFV6P8TX_www.dev.plancraftr.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "www.dev.plancraftr.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z097947118UN4SFV6P8TX" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d1vke0k0ycay30.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_record.www_staging_plancraftr will be created
  + resource "aws_route53_record" "www_staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.dev_plancraftr_com will be destroyed
  # (because aws_s3_bucket.dev_plancraftr_com is not in configuration)
  - resource "aws_s3_bucket" "dev_plancraftr_com" {
      - arn                         = "arn:aws:s3:::dev.plancraftr.com" -> null
      - bucket                      = "dev.plancraftr.com" -> null
      - bucket_domain_name          = "dev.plancraftr.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev.plancraftr.com.s3.ap-southeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3O0J2DXBE1FTB" -> null
      - id                          = "dev.plancraftr.com" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-southeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-ap-southeast-1.amazonaws.com" -> null
      - website_endpoint            = "dev.plancraftr.com.s3-website-ap-southeast-1.amazonaws.com" -> null

      - grant {
          - id          = "d0d5865aab8a19aced456adc821106829690db9b60af200d586eecbe06284fa7" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - redirect_all_requests_to = "https://www.dev.plancraftr.com" -> null
        }
    }

  # aws_s3_bucket.staging_plancraftr_com will be created
  + resource "aws_s3_bucket" "staging_plancraftr_com" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging.plancraftr.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket.www_dev_plancraftr_com will be destroyed
  # (because aws_s3_bucket.www_dev_plancraftr_com is not in configuration)
  - resource "aws_s3_bucket" "www_dev_plancraftr_com" {
      - arn                         = "arn:aws:s3:::www.dev.plancraftr.com" -> null
      - bucket                      = "www.dev.plancraftr.com" -> null
      - bucket_domain_name          = "www.dev.plancraftr.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "www.dev.plancraftr.com.s3.ap-southeast-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3O0J2DXBE1FTB" -> null
      - id                          = "www.dev.plancraftr.com" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Id        = "PlancraftrS3AccessPolicy"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::www.dev.plancraftr.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "ap-southeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-ap-southeast-1.amazonaws.com" -> null
      - website_endpoint            = "www.dev.plancraftr.com.s3-website-ap-southeast-1.amazonaws.com" -> null

      - grant {
          - id          = "d0d5865aab8a19aced456adc821106829690db9b60af200d586eecbe06284fa7" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket.www_staging_plancraftr_com will be created
  + resource "aws_s3_bucket" "www_staging_plancraftr_com" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "www.staging.plancraftr.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_dev will be destroyed
  # (because aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_dev is not in configuration)
  - resource "aws_s3_bucket_policy" "allow_anyone_get_objects_s3_www_dev" {
      - bucket = "www.dev.plancraftr.com" -> null
      - id     = "www.dev.plancraftr.com" -> null
      - policy = jsonencode(
            {
              - Id        = "PlancraftrS3AccessPolicy"
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::www.dev.plancraftr.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_staging will be created
  + resource "aws_s3_bucket_policy" "allow_anyone_get_objects_s3_www_staging" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "PlancraftrS3AccessPolicy"
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::www.staging.plancraftr.com/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_public_access_block.allow_public_access_s3_www_dev will be destroyed
  # (because aws_s3_bucket_public_access_block.allow_public_access_s3_www_dev is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "allow_public_access_s3_www_dev" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "www.dev.plancraftr.com" -> null
      - id                      = "www.dev.plancraftr.com" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # aws_s3_bucket_public_access_block.allow_public_access_s3_www_staging will be created
  + resource "aws_s3_bucket_public_access_block" "allow_public_access_s3_www_staging" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_website_configuration.static_website_config_s3_dev will be destroyed
  # (because aws_s3_bucket_website_configuration.static_website_config_s3_dev is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "static_website_config_s3_dev" {
      - bucket           = "dev.plancraftr.com" -> null
      - id               = "dev.plancraftr.com" -> null
      - website_domain   = "s3-website-ap-southeast-1.amazonaws.com" -> null
      - website_endpoint = "dev.plancraftr.com.s3-website-ap-southeast-1.amazonaws.com" -> null

      - redirect_all_requests_to {
          - host_name = "www.dev.plancraftr.com" -> null
          - protocol  = "https" -> null
        }
    }

  # aws_s3_bucket_website_configuration.static_website_config_s3_staging will be created
  + resource "aws_s3_bucket_website_configuration" "static_website_config_s3_staging" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "www.staging.plancraftr.com"
          + protocol  = "https"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.static_website_config_s3_www_dev will be destroyed
  # (because aws_s3_bucket_website_configuration.static_website_config_s3_www_dev is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "static_website_config_s3_www_dev" {
      - bucket           = "www.dev.plancraftr.com" -> null
      - id               = "www.dev.plancraftr.com" -> null
      - website_domain   = "s3-website-ap-southeast-1.amazonaws.com" -> null
      - website_endpoint = "www.dev.plancraftr.com.s3-website-ap-southeast-1.amazonaws.com" -> null

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # aws_s3_bucket_website_configuration.static_website_config_s3_www_staging will be created
  + resource "aws_s3_bucket_website_configuration" "static_website_config_s3_www_staging" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_security_group.dev_server_plancraftr_sg will be destroyed
  # (because aws_security_group.dev_server_plancraftr_sg is not in configuration)
  - resource "aws_security_group" "dev_server_plancraftr_sg" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:084828604403:security-group/sg-03d3312484bb4166f" -> null
      - description            = "Allow HTTP and HTTPS traffic from the internet" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-03d3312484bb4166f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow HTTP traffic"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow HTTPS traffic"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow SSH access"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "dev_server_plancraftr_sg" -> null
      - owner_id               = "084828604403" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0d9f71e94f5bef872" -> null
    }

  # aws_security_group.staging_server_plancraftr_sg will be created
  + resource "aws_security_group" "staging_server_plancraftr_sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and HTTPS traffic from the internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "staging_server_plancraftr_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 14 to add, 0 to change, 14 to destroy.

Changes to Outputs:
  - dev_public_ip     = "13.229.69.60" -> null
  + staging_public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*